# IsVisibleInUI Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..IsVisibleInUI Property
Category Class See Also
---
Identifies if the category is visible to the user and should be displayed in UI.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool IsVisibleInUI { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsVisibleInUI As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsVisibleInUI {
	bool get ();
}
```

# ### Field Value
True if the category should be displayed in UI.
# See Also
Category Class
Autodesk.Revit.DB Namespace